import MainPageEffectImage from '../../assets/img/MainPageEffectImage.png';
import list3 from '../../assets/img/mainList3.png';
import list4 from '../../assets/img/mainList4.png';
import list3320 from '../../assets/img/mainlist3320.png';
import list4320 from '../../assets/img/mainlist4320.png';

function MainPageEffect() {
  return (
    <div className="MainPageEffect">
      <img src={list3} alt="" className="list"></img>
      <img src={list4} alt="" className="list2"></img>
      <h2 className="MainPageEffect__title">
        ЭФФЕКТИВНАЯ<br></br>ФОРМУЛА УХОДА
      </h2>
      <img src={MainPageEffectImage} alt="" className="image"></img>
      <h3 className="MainPageEffect__titleLow">Если вы:</h3>
      <div className="MainPageEffect__wrap">
        <div className="MainPageEffect__wrap__box">
          устали покупать разрекламированные средства без видимого результата
        </div>
        <div className="MainPageEffect__wrap__box">лечитесь у дерматолога с розацеа и акне</div>
        <div className="MainPageEffect__wrap__box">
          замечаете ухудшение состояния кожи после новых средств
        </div>
        <div className="MainPageEffect__wrap__box">
          чувствуете сухость и стянутость кожи в течение дня
        </div>
        <div className="MainPageEffect__wrap__box">имеете гиперчувствительную кожу</div>
        <div className="MainPageEffect__wrap__box">
          спользуете все более агрессивные средства для жирной кожи
        </div>
      </div>
      <span className="MainPageEffect__underWrap__span">
        …. попробуйте профессиональную линию домашнего ухода от “Ясноликой”
      </span>
      <p className="MainPageEffect__underWrap__text">
        Вашей коже не нужен ансамбль из тюбиков на полке, чтобы выглядеть ухоженно и молодо!
        <br />
        Достаточно 3 - 4 правильно подобранных средств <span>по формуле базового ухода:</span>
      </p>
      <div className="MainPageEffect__row">
        <div className="MainPageEffect__row__col">
          <h4>Очищение</h4>
          <span>
            (не пересушить<br></br>и мягко очистить)
          </span>
        </div>
        <svg
          width="65"
          height="48"
          viewBox="0 0 65 48"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
          className="svg1320">
          <path
            d="M62.9872 39.3648C63.4791 41.184 63.9595 43.106 64.3836 44.9377C64.7855 46.4422 63.3628 47.6515 62.2561 46.6841C61.6933 46.2243 61.1372 45.7509 60.5774 45.2848C58.9539 43.8982 57.2799 42.4049 55.7184 40.903C53.5933 38.8539 51.4849 36.6991 49.5872 34.3217C49.5236 34.2416 49.5994 34.1095 49.6825 34.1797L53.0326 36.8804C55.0835 38.5552 60.1169 42.6702 62.2214 44.3903C56.6115 33.9034 49.3838 24.569 40.9361 17.3515C31.0826 8.91895 19.6848 3.52283 8.24352 1.65945C6.30675 1.33273 4.37226 1.12377 2.43332 0.953523C1.8405 0.809055 -0.324604 0.88965 0.0675763 0.516173C24.4088 -1.41546 50.5651 16.6875 62.6459 44.5489C61.9887 41.6342 60.4065 34.6428 59.7699 31.8155L58.7825 27.3306C58.778 27.3073 58.7803 27.2838 58.789 27.2643C58.7977 27.2447 58.8123 27.2304 58.8301 27.224C58.848 27.2175 58.8679 27.2193 58.8863 27.229C58.9048 27.2387 58.9205 27.2557 58.9307 27.277C60.6023 31.1735 61.8561 35.2698 62.9872 39.3648Z"
            fill="#108C3D"
          />
        </svg>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="307"
          height="307"
          viewBox="0 0 307 307"
          fill="none"
          className="svg1">
          <path
            d="M267.904 141.155C271.611 145.262 275.404 149.673 278.913 153.938C281.964 157.343 278.93 163.265 274.303 162.622C271.988 162.384 269.678 162.096 267.365 161.835C260.616 160.981 253.581 159.927 246.89 158.643C237.777 156.883 228.592 154.8 219.804 151.722C219.509 151.618 219.59 151.116 219.935 151.158L233.671 152.477C242.105 153.343 262.812 155.482 271.468 156.375C241.38 137.76 207.577 125.265 172.456 120.819C131.473 115.594 89.2455 121.539 51.0784 137.28C44.604 139.914 38.2768 142.868 31.9815 145.936C29.947 146.619 23.2391 150.79 24.0278 149.047C98.2232 99.3384 201.926 101.43 272.991 156.038C267.463 149.218 254.184 132.872 248.825 126.256L240.393 115.72C240.351 115.664 240.331 115.595 240.335 115.525C240.339 115.456 240.368 115.39 240.416 115.34C240.465 115.289 240.529 115.258 240.599 115.251C240.668 115.244 240.738 115.262 240.795 115.302C250.678 122.972 259.484 131.953 267.904 141.155Z"
            fill="#108C3D"
          />
        </svg>
        <div className="MainPageEffect__row__col MainPageEffect__secondpoint">
          <h4>Тонизирование</h4>
          <span>
            (завершить очищение,<br></br>снять раздражение,<br></br>увлажнить
            <br></br>и успокоить кожу)
          </span>
        </div>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="307"
          viewBox="0 0 307 307"
          fill="none"
          className="svg2">
          <path
            d="M266.178 173.939C270.185 170.138 274.302 166.041 278.124 162.067C281.424 158.914 278.862 152.785 274.207 153.068C271.884 153.126 269.563 153.234 267.241 153.314C260.458 153.642 253.374 154.147 246.615 154.907C237.41 155.955 228.106 157.317 219.121 159.701C218.82 159.782 218.862 160.288 219.208 160.273L232.981 160.023C241.443 159.813 262.218 159.285 270.903 159.065C239.517 175.267 204.906 185.088 169.606 186.797C128.412 188.828 86.8422 179.646 50.0719 161.026C43.8317 157.904 37.7626 154.475 31.7343 150.935C29.7621 150.097 23.4083 145.427 24.0585 147.222C94.0609 202.436 197.438 208.374 272.392 159.519C266.362 165.879 251.882 181.122 246.036 187.292L236.83 197.127C236.784 197.179 236.758 197.246 236.756 197.316C236.755 197.385 236.779 197.453 236.823 197.507C236.867 197.561 236.929 197.597 236.998 197.609C237.067 197.621 237.137 197.609 237.197 197.574C247.626 190.704 257.086 182.446 266.178 173.939Z"
            fill="#108C3D"
          />
        </svg>
        <div className="MainPageEffect__row__col">
          <h4>Увлажнение</h4>
          <span>
            (сохранить водный баланс<br></br>в течение дня и ночи,<br></br>
            восстановить защитный<br></br>гидролипидный барьер)
          </span>
        </div>
        <svg
          width="46"
          height="71"
          viewBox="0 0 46 71"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
          className="svg2320">
          <path
            d="M8.13501 69.1637C6.3418 69.6863 4.44657 70.1995 2.63962 70.6552C1.15653 71.0826 -0.0693415 69.6961 0.867993 68.5808C1.31274 68.0141 1.7711 67.454 2.22209 66.8902C3.56481 65.2546 5.01224 63.5669 6.47035 61.9905C8.45973 59.8451 10.5543 57.7142 12.8735 55.7877C12.9516 55.7232 13.084 55.7957 13.016 55.8794L10.4045 59.2513C8.78457 61.316 4.80416 66.3833 3.1403 68.502C13.4237 62.7403 22.5339 55.3976 29.5227 46.8869C37.6883 36.9597 42.8152 25.5609 44.4406 14.1874C44.7269 12.2618 44.8966 10.3408 45.0278 8.41617C45.1595 7.82592 43.9653 -8.57371 45.4155 6.06341C47.8001 30.1467 30.3667 56.4159 2.9913 68.9257C5.86693 68.2182 12.7644 66.5152 15.5537 65.8297L19.9789 64.7646C20.0019 64.7596 20.0253 64.7614 20.0448 64.7697C20.0643 64.778 20.0787 64.7921 20.0855 64.8097C20.0922 64.8272 20.0909 64.847 20.0816 64.8655C20.0723 64.8839 20.0558 64.8998 20.0349 64.9104C16.206 66.6421 12.1711 67.9637 8.13501 69.1637Z"
            fill="#108C3D"
          />
        </svg>
      </div>
      <div className="MainPageEffect__leastes">
        <img src={list3320} alt="" className="list3320"></img>
        <img src={list4320} alt="" className="list4320"></img>
      </div>
    </div>
  );
}
export default MainPageEffect;
