import MainPageEffectImage from "../../assets/img/MainPageEffectImage.png";
import list3 from '../../assets/img/mainList3.png';
import list4 from '../../assets/img/mainList4.png';

function MainPageEffect() {
  return (
    <div className="MainPageEffect">
      <img src={list3} alt="" className="list"></img>
      <img src={list4} alt="" className="list2"></img>
      <h2 className="MainPageEffect__title">
        ЭФФЕКТИВНАЯ<br></br>ФОРМУЛА УХОДА
      </h2>
      <img src={MainPageEffectImage} alt="" className="image"></img>
      <h3 className="MainPageEffect__titleLow">Если вы:</h3>
      <div className="MainPageEffect__wrap">
        <div className="MainPageEffect__wrap__box">
          устали покупать разрекламированные средства без видимого результата
        </div>
        <div className="MainPageEffect__wrap__box">
          лечитесь у дерматолога с розацеа и акне
        </div>
        <div className="MainPageEffect__wrap__box">
          замечаете ухудшение состояния кожи после новых средств
        </div>
        <div className="MainPageEffect__wrap__box">
          чувствуете сухость и стянутость кожи в течение дня
        </div>
        <div className="MainPageEffect__wrap__box">
          имеете гиперчувствительную кожу
        </div>
        <div className="MainPageEffect__wrap__box">
          спользуете все более агрессивные средства для жирной кожи
        </div>
      </div>
      <span className="MainPageEffect__underWrap__span">
        …. попробуйте профессиональную линию домашнего ухода от “Ясноликой”
      </span>
      <p className="MainPageEffect__underWrap__text">
        Вашей коже не нужен ансамбль из тюбиков на полке, чтобы выглядеть
        ухоженно и молодо!<br />Достаточно 3 - 4 правильно подобранных
        средств <span>по формуле базового ухода:</span>
      </p>
      <div className="MainPageEffect__row">
        <div className="MainPageEffect__row__col">
          <h4>Очищение</h4>
          <span>
            (не пересушить<br></br>и мягко очистить)
          </span>
        </div>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="307"
          height="307"
          viewBox="0 0 307 307"
          fill="none"
          className="svg1"
        >
          <path
            d="M267.904 141.155C271.611 145.262 275.404 149.673 278.913 153.938C281.964 157.343 278.93 163.265 274.303 162.622C271.988 162.384 269.678 162.096 267.365 161.835C260.616 160.981 253.581 159.927 246.89 158.643C237.777 156.883 228.592 154.8 219.804 151.722C219.509 151.618 219.59 151.116 219.935 151.158L233.671 152.477C242.105 153.343 262.812 155.482 271.468 156.375C241.38 137.76 207.577 125.265 172.456 120.819C131.473 115.594 89.2455 121.539 51.0784 137.28C44.604 139.914 38.2768 142.868 31.9815 145.936C29.947 146.619 23.2391 150.79 24.0278 149.047C98.2232 99.3384 201.926 101.43 272.991 156.038C267.463 149.218 254.184 132.872 248.825 126.256L240.393 115.72C240.351 115.664 240.331 115.595 240.335 115.525C240.339 115.456 240.368 115.39 240.416 115.34C240.465 115.289 240.529 115.258 240.599 115.251C240.668 115.244 240.738 115.262 240.795 115.302C250.678 122.972 259.484 131.953 267.904 141.155Z"
            fill="#108C3D"
          />
        </svg>
        <div className="MainPageEffect__row__col">
          <h4>Тонизирование</h4>
          <span>
            (завершить очищение,<br></br>снять раздражение,<br></br>увлажнить
            <br></br>и успокоить кожу)
          </span>
        </div>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="307"
          viewBox="0 0 307 307"
          fill="none"
          className="svg2"
        >
          <path
            d="M266.178 173.939C270.185 170.138 274.302 166.041 278.124 162.067C281.424 158.914 278.862 152.785 274.207 153.068C271.884 153.126 269.563 153.234 267.241 153.314C260.458 153.642 253.374 154.147 246.615 154.907C237.41 155.955 228.106 157.317 219.121 159.701C218.82 159.782 218.862 160.288 219.208 160.273L232.981 160.023C241.443 159.813 262.218 159.285 270.903 159.065C239.517 175.267 204.906 185.088 169.606 186.797C128.412 188.828 86.8422 179.646 50.0719 161.026C43.8317 157.904 37.7626 154.475 31.7343 150.935C29.7621 150.097 23.4083 145.427 24.0585 147.222C94.0609 202.436 197.438 208.374 272.392 159.519C266.362 165.879 251.882 181.122 246.036 187.292L236.83 197.127C236.784 197.179 236.758 197.246 236.756 197.316C236.755 197.385 236.779 197.453 236.823 197.507C236.867 197.561 236.929 197.597 236.998 197.609C237.067 197.621 237.137 197.609 237.197 197.574C247.626 190.704 257.086 182.446 266.178 173.939Z"
            fill="#108C3D"
          />
        </svg>
        <div className="MainPageEffect__row__col">
          <h4>Увлажнение</h4>
          <span>
            (сохранить водный баланс<br></br>в течение дня и ночи,<br></br>
            восстановить защитный<br></br>гидролипидный барьер)
          </span>
        </div>
      </div>
    </div>
  );
}
export default MainPageEffect;
